Repository: adrianlicko/Flutter-Django-calendar-app
Catalog: frontend/lib/l10n/app_*.arb
Languages: sk

# mondayShortcut
source: Mo
sk: Po

# tuesdayShortcut
source: Tu
sk: Ut

# wednesdayShortcut
source: We
sk: St

# thursdayShortcut
source: Th
sk: Št

# fridayShortcut
source: Fr
sk: Pi

source: was removed
sk: bol vymazaný

source: Calendar
sk: Kalendár

source: To Do tasks
sk: To Do úlohy

source: Profile
sk: Profil

source: Change email
sk: Zmeniť email

source: Change password
sk: Zmeniť heslo

source: Show todo tasks in calendar
sk: Zobraziť To Do úlohy v kalendáry

# removeTodoFromCalendarWhenCompleted
source: Remove To Do task from calendar when it`s completed
sk: Vymazať To Do úlohu z kalendára po jej dokončení

source: Application settings
sk: Nastavenia aplikácie

source: Change language
sk: Zmeniť jazyk

source: Change theme
sk: Zmeniť tému

# areaCannotBeEmpty
source: Area can`t be empty
sk: Pole nesmie byť prázdne

# firstName
source: Name
sk: Meno

# lastName
source: Surname
sk: Priezvisko

source: Incorrect email format
sk: Email má nesprávny formát

source: Password
sk: Heslo

# passwordMustBeLonger
source: Password must be at least 6 characters long
sk: Heslo musí mať aspoň 6 znakov

source: Register
sk: Registrovať

source: Login
sk: Prihlásiť

source: Already have account?
sk: Už máte účet?

source: Don`t have account yet?
sk: Ešte nemáte účet?

source: Change name
sk: Zmeniť meno

source: Save
sk: Uložiť

source: Failed to login
sk: Nepodarilo sa prihlásiť

source: Failed to register
sk: Nepodarilo sa registrovať

source: Failed to add todo
sk: Úlohu sa nepodarilo pridať

source: Failed to update todo
sk: Úlohu sa nepodarilo aktualizovať

source: Failed to delete todo
sk: Úlohu sa nepodarilo vymazať

source: Failed to get todos
sk: Nepodarilo sa získať ToDo úlohy

source: Failed to update user data
sk: Nepodarilo sa aktualizovať používateľské údaje

source: Failed to update user settings
sk: Nepodarilo sa aktualizovať používateľské nastavenia

source: Failed to get schedules
sk: Nepodarilo sa získať rozvrh hodín

source: Failed to add schedule
sk: Nepodarilo sa pridať rozvrh hodín

source: Failed to delete schedule
sk: Nepodarilo sa vymazať rozvrh hodín

source: Capture
sk: Odfotiť

# captureAndCrop
source: Capture & Crop
sk: Odfotiť a orezať

source: Image was saved to gallery
sk: Fotografia bola uložená do galérie

source: Show
sk: Zobraziť

source: Failed to load documents
sk: Nepodarilo sa načítať dáta

source: Failed to delete document
sk: Nepodarilo sa vymazať dokument

# youHaveNoDocuments
source: You have no scanned documents
sk: Nemáš žiadne naskenované dokumenty

source: Scan
sk: Skenovať

source: Gallery
sk: Galéria

source: Scanner
sk: Skener

# noCameraPermission
source: Camera permission is required.
sk: Prístup ku kamere je povinný.

source: Open Settings
sk: Otvoriť nastavenia

source: No internet connection
sk: Žiadne internetové pripojenie

source: Cannot access backend
sk: Backend nie je prístupný

source: Bad request
sk: Zlý request

source: Recognized text
sk: Rozpoznaný text

# textWasCopied
source: Text was copied to clipboard
sk: Text bol skopírovaný do schránky
